# BarsTooCloseNumber Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..BarsTooCloseNumber Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Bars are too close together. Decrease the Number Of Lines parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BarsTooCloseNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BarsTooCloseNumber As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BarsTooCloseNumber {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace